Catalogs/ПравилаПоискаДублейНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаПоискаДублейНСИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переопределяемое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДублиНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДублиНСИ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оригинал</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМестИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоискаМестИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеУдаленияДубля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияУдаленияДублейНСИ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкиЗамены</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокЗамены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дубль</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДублиНСИКПодтверждению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДублиНСИКПодтверждению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПоискаДублейНСИ</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМестИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоискаМестИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДублей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дубль</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПравилаПоискаДублейНСИ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов справочника
//
// Параметры:
//  Настройки - Структура - настройки начального заполнения
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	Настройки.ПриНачальномЗаполненииЭлементов = Истина;
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив Из Строка- список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника.
//  ТабличныеЧасти - Структура - Ключ - имя табличной части объекта
//                               Значение - Выгрузка в таблицу значений пустой табличной части.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	СоздатьИлиОбновитьПредопределенныйЭлемент(
		Метаданные.Справочники.ПравилаПоискаДублейНСИ.Предопределенные.Контрагенты_СовпадаетИННКПП);
	СоздатьИлиОбновитьПредопределенныйЭлемент(
		Метаданные.Справочники.ПравилаПоискаДублейНСИ.Предопределенные.Контрагенты_СовпадаетКонтактнаяИнформацияИНеЗаполненИНН);
	СоздатьИлиОбновитьПредопределенныйЭлемент(
		Метаданные.Справочники.ПравилаПоискаДублейНСИ.Предопределенные.Контрагенты_СовпадаетНаименованиеИКонтактнаяИнформация);
	СоздатьИлиОбновитьПредопределенныйЭлемент(
		Метаданные.Справочники.ПравилаПоискаДублейНСИ.Предопределенные.Контрагенты_СовпадаетНомерБанковскогоСчета);
	СоздатьИлиОбновитьПредопределенныйЭлемент(
		Метаданные.Справочники.ПравилаПоискаДублейНСИ.Предопределенные.Контрагенты_СовпадаетРегистрационныйИлиНалоговыйНомерНерезидента);
	СоздатьИлиОбновитьПредопределенныйЭлемент(
		Метаданные.Справочники.ПравилаПоискаДублейНСИ.Предопределенные.Номенклатура_ПоНастройкамУникальностиВидаНоменклатуры);
	СоздатьИлиОбновитьПредопределенныйЭлемент(
		Метаданные.Справочники.ПравилаПоискаДублейНСИ.Предопределенные.Номенклатура_СовпадаетНаименование);
	СоздатьИлиОбновитьПредопределенныйЭлемент(
		Метаданные.Справочники.ПравилаПоискаДублейНСИ.Предопределенные.Партнеры_СовпадаетКонтактнаяИнформация);
	СоздатьИлиОбновитьПредопределенныйЭлемент(
		Метаданные.Справочники.ПравилаПоискаДублейНСИ.Предопределенные.Партнеры_СовпадаетНаименование);
	СоздатьИлиОбновитьПредопределенныйЭлемент(
		Метаданные.Справочники.ПравилаПоискаДублейНСИ.Предопределенные.ХарактеристикиНоменклатуры_ПоНастройкамУникальностиВидаНоменклатуры);
	СоздатьИлиОбновитьПредопределенныйЭлемент(
		Метаданные.Справочники.ПравилаПоискаДублейНСИ.Предопределенные.ХарактеристикиНоменклатуры_СовпадаетНаименование);
	
КонецПроцедуры

// Сформировать запрос по правилу.
// 
// Параметры:
//  Правило - СправочникСсылка.ПравилаПоискаДублейНСИ - Правило поиска дублей
//  ТолькоНовыеДубли - Булево - Только новые дубли
//  Объекты - Массив Из ЛюбаяСсылка - Массив ссылок НСИ, для ограничения области поиска дублей
// 
// Возвращаемое значение:
//  Запрос - Запрос сформированный по правилу поиска дублей НСИ
Функция СформироватьЗапросПоПравилу(Правило, ТолькоНовыеДубли = Истина, Объекты = Неопределено) Экспорт
	РеквизитыПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Правило, "Запрос, Переопределяемое");
	СтруктураЗапроса = РеквизитыПравила.Запрос.Получить();
	Переопределяемое = РеквизитыПравила.Переопределяемое;
	Если Переопределяемое Тогда
		Запрос = ПоискИЗаменаДублейНСИПереопределяемый.СформироватьЗапросПоПравилу(Правило, ТолькоНовыеДубли, Объекты);
	Иначе
		Если ТипЗнч(СтруктураЗапроса) <> Тип("Структура") Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'В шаблоне %1 отсутствует текст запроса поиска дублей'"),Правило));
			Возврат "";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтруктураЗапроса.ТекстЗапроса)  Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'В шаблоне %1 отсутствует текст запроса поиска дублей'"),Правило));
			Возврат "";
		КонецЕсли;
		Запрос = Новый Запрос;
		Если СтруктураЗапроса.Свойство("ПараметрыЗапроса")
			И ТипЗнч(СтруктураЗапроса.ПараметрыЗапроса) = Тип("ХранилищеЗначения") Тогда
			ПараметрыЗапроса = СтруктураЗапроса.ПараметрыЗапроса.Получить();
			Для Каждого СтрокаПараметра Из ПараметрыЗапроса Цикл
				Запрос.УстановитьПараметр(СтрокаПараметра.Имя, СтрокаПараметра.Значение);
			КонецЦикла;
		КонецЕсли;
		
		ТекстыЗапросов = Новый Массив;
		СхемаЗапроса = Новый СхемаЗапроса;
		
		СхемаЗапроса.УстановитьТекстЗапроса(СтруктураЗапроса.ТекстЗапроса);
		Если СхемаЗапроса.ПакетЗапросов.Количество() > 1 Тогда
			ПакетШаблона = Неопределено;
			Для Каждого Пакет Из СхемаЗапроса.ПакетЗапросов Цикл
				Если ТипЗнч(Пакет) = Тип("ЗапросВыбораСхемыЗапроса") 
					И Пакет.ТаблицаДляПомещения = "" Тогда
					ПакетШаблона = Пакет;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ПакетШаблона = СхемаЗапроса.ПакетЗапросов[0];
		КонецЕсли;
		ПакетШаблона.ТаблицаДляПомещения = "ВТ_Правило";
		Если Объекты <> Неопределено Тогда
			Запрос.УстановитьПараметр("Объекты", Объекты);
			Для Каждого ОператорВыбора Из ПакетШаблона.Операторы Цикл
				Для Каждого Поле Из ОператорВыбора.ВыбираемыеПоля Цикл
					ОператорВыбора.Отбор.Добавить(СтрШаблон("%1 В (&Объекты)",Строка(Поле)));
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		ПакетШаблона.Колонки[0].Псевдоним = "Ссылка";
		ПакетШаблона.Колонки[1].Псевдоним = "Ссылка1";
		ТекстыЗапросов.Добавить(СхемаЗапроса.ПолучитьТекстЗапроса());

		ТекстЗапросаЗарегистрированные = Новый Массив;
		ТекстЗапросаЗарегистрированные.Добавить(
		"ВЫБРАТЬ
		|	Таблица.Оригинал КАК Дубль
		|ПОМЕСТИТЬ ЗарегистрированныеДубли
		|ИЗ
		|	РегистрСведений.ДублиНСИ КАК Таблица
		|ГДЕ
		|	Таблица.Оригинал В(&ТаблицаПроверкиВхождений)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Таблица.Дубль
		|ИЗ
		|	РегистрСведений.ДублиНСИ КАК Таблица
		|ГДЕ
		|	Таблица.Дубль В(&ТаблицаПроверкиВхождений)");
		
		Если ТолькоНовыеДубли Тогда
			ТекстЗапросаЗарегистрированные.Добавить( 
			"ВЫБРАТЬ 
			|	Таблица.Дубль 
			|ИЗ
			|	РегистрСведений.ДублиНСИКПодтверждению КАК Таблица
			|ГДЕ
			|	Таблица.Дубль В (&ТаблицаПроверкиВхождений)");
		КонецЕсли;
		ТекстЗапросаЗарегистрированные = СтрСоединить(ТекстЗапросаЗарегистрированные, 
		"
		|
		|ОБЪЕДИНИТЬ
		|
		|");
		
		ТаблицыПроверкиВхождений = Новый Массив;
		Шаблон = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|	ВТ_Правило.Ссылка
		|ИЗ 
		|	ВТ_Правило";
		Для Каждого Поле Из ПакетШаблона.Колонки Цикл
			ТаблицыПроверкиВхождений.Добавить(СтрЗаменить(Шаблон, "Ссылка", Поле.Псевдоним));
		КонецЦикла;
		ТаблицыПроверкиВхожденийСтр = СтрСоединить(ТаблицыПроверкиВхождений, " ОБЪЕДИНИТЬ ");
		ТекстЗапросаЗарегистрированные = СтрЗаменить(ТекстЗапросаЗарегистрированные, 
					"&ТаблицаПроверкиВхождений",
					ТаблицыПроверкиВхожденийСтр);
		ТекстыЗапросов.Добавить(ТекстЗапросаЗарегистрированные);
		
		ТекстЗапросаВыбор = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.Ссылка,
		|	Таблица.Ссылка1
		|ИЗ
		|	ВТ_Правило КАК Таблица
		|ГДЕ
		|	НЕ Таблица.Ссылка В (
		|		ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЗарегистрированныеДубли.Дубль
		|		ИЗ ЗарегистрированныеДубли КАК ЗарегистрированныеДубли)
		|	И НЕ Таблица.Ссылка1 В (
		|		ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЗарегистрированныеДубли.Дубль
		|		ИЗ ЗарегистрированныеДубли КАК ЗарегистрированныеДубли)";
		ТекстыЗапросов.Добавить(ТекстЗапросаВыбор);
		
		ТекстЗапроса = СтрСоединить(ТекстыЗапросов, "
		|
		|;
		|
		|");
		
		Запрос.Текст = ТекстЗапроса;
	КонецЕсли;
	Возврат Запрос;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает или обновляет предопределенный элемент справочника
//
// Параметры:
//  ПредопределенныйЭлемент - ОбъектМетаданныхСправочник - предопределенный элемент
//
Процедура СоздатьИлиОбновитьПредопределенныйЭлемент(ПредопределенныйЭлемент) Экспорт
	
	ИмяЭлемента = ПредопределенныйЭлемент.Имя;
	Ссылка = Справочники.ПравилаПоискаДублейНСИ[ИмяЭлемента];
	
	Если Ссылка.Пустая() Тогда
		Объект = Справочники.ПравилаПоискаДублейНСИ.СоздатьЭлемент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если Объект <> Неопределено Тогда
		Объект.ИмяПредопределенныхДанных = ИмяЭлемента;
		Объект.Наименование = ПредопределенныйЭлемент.Синоним;
		ЗаполнитьПоставляемоеПравило(Объект);
		Попытка
			Объект.Записать();
		Исключение
			ИнфоОшибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Заполнение предопределенных элементов'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				СтрШаблон(НСтр("ru = 'Ошибка при сохранении предопределенного элемента %1: %2'",
					ОбщегоНазначения.КодОсновногоЯзыка()), ИмяЭлемента, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфоОшибка)));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет поставляемое правило поиска дублей из обработчика обновления и при восстановлении 
// правила из формы элемента.
//
// Параметры:
//  Объект - СправочникОбъект.ПравилаПоискаДублейНСИ - объект правила
//
Процедура ЗаполнитьПоставляемоеПравило(Объект) Экспорт
	
	ПоискИЗаменаДублейНСИПереопределяемый.ЗаполнитьПоставляемоеПравило(Объект);
	
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ПравилаПоискаДублейНСИ.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.27.24";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6ea64a13-b0e3-47ef-ae0a-fd56db0a7ef1");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.ПравилаПоискаДублейНСИ.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Обновление справочника ""Правила поиска дублей НСИ"":'"));
	СписокОписаний.Добавить(НСтр("ru = '- Заполнение поставляемых правил поиска дублей'"));
	
	Обработчик.Комментарий = СтрСоединить(СписокОписаний, Символы.ПС);
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Справочники.ПравилаПоискаДублейНСИ.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Справочники.ПравилаПоискаДублейНСИ.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Справочники.ПравилаПоискаДублейНСИ.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаПоискаДублейНСИ.Ссылка КАК Ссылка,
	|	ПравилаПоискаДублейНСИ.Переопределяемое КАК Переопределяемое,
	|	ПравилаПоискаДублейНСИ.Изменено КАК Изменено,
	|	ПравилаПоискаДублейНСИ.Запрос КАК Запрос
	|ИЗ
	|	Справочник.ПравилаПоискаДублейНСИ КАК ПравилаПоискаДублейНСИ
	|ГДЕ
	|	ПравилаПоискаДублейНСИ.Предопределенный";
	
	ДанныеКОбработке = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Переопределяемые = Новый Массив;
	Переопределяемые.Добавить(Справочники.ПравилаПоискаДублейНСИ.Справочник_Номенклатура_ПоНастройкамУникальностиВидаНоменклатуры);
	Переопределяемые.Добавить(Справочники.ПравилаПоискаДублейНСИ.Справочник_ХарактеристикиНоменклатуры_ПоНастройкамУникальностиВидаНоменклатуры);
	Пока Выборка.Следующий() Цикл
		Если Не Переопределяемые.Найти(Выборка.Ссылка) = Неопределено Тогда
			Если Не Выборка.Переопределяемое Тогда
				ДанныеКОбработке.Добавить(Выборка.Ссылка);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		ТекстЗапроса = "";
		СохраненныйЗапрос = Выборка.Запрос.Получить();
		Если ЗначениеЗаполнено(СохраненныйЗапрос) Тогда
			ТекстЗапроса = СохраненныйЗапрос.ТекстЗапроса;
		КонецЕсли;
		
		Если Выборка.Изменено Или ТекстЗапроса <> "" Тогда
			Продолжить;
		КонецЕсли;
		ДанныеКОбработке.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ДанныеКОбработке);
	
КонецПроцедуры

// Обработчик обновления
// 
// Параметры:
// 	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки 
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПолноеИмяОбъекта = ПустаяСсылка().Метаданные().ПолноеИмя();
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		
		Параметры.ОбработкаЗавершена =
			ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
		
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПлохиеДанные = Новый Массив;
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Не удалось обработать справочник ""Правила поиска дублей НСИ"" по обработчику:'"));
	СписокОписаний.Добавить(НСтр("ru = '- Заполнение поставляемых правил поиска дублей';"));
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДляОбновления.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ДанныеДляОбновления КАК ДанныеДляОбновления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ПравилаПоискаДублейНСИ.ВерсияДанных КАК ВерсияДанных
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПоискаДублейНСИ КАК ПравилаПоискаДублейНСИ
	|			ПО ВТ.Ссылка = ПравилаПоискаДублейНСИ.Ссылка";
	
	Запрос.УстановитьПараметр("ДанныеДляОбновления", ОбновляемыеДанные);
	
	Справочник = Запрос.Выполнить().Выбрать();
	
	Пока Справочник.Следующий() Цикл
		
		ПричинаИсключения = Неопределено;
		Рекомендация = "";
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = "Блокировка";
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Справочник.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			СправочникОбъект = ОбновлениеИнформационнойБазыУТ.ПроверитьПолучитьОбъект(
				Справочник.Ссылка, Справочник.ВерсияДанных, Параметры.Очередь); // СправочникОбъект
			
			ПричинаИсключения = "ПлохиеДанные";
			Рекомендация = НСтр("ru = 'Проверьте данные справочника вручную.'");
			
			Если СправочникОбъект <> Неопределено Тогда
				
				ПоискИЗаменаДублейНСИПереопределяемый.ЗаполнитьПоставляемоеПравило(СправочникОбъект);
				
			КонецЕсли;
			
			ПричинаИсключения = "Запись";
			
			Если СправочникОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Справочник.Ссылка);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Справочник.Ссылка);
			
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				
				ОписаниеПроблемы = ОбновлениеИнформационнойБазыУТ.ПроблемаСДанными(
					Справочник.Ссылка, Рекомендация, ИнформацияОбОшибке());
					ПлохиеДанные.Добавить(ОписаниеПроблемы);
				
			ИначеЕсли ПричинаИсключения <> "Блокировка" Тогда
				
				ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(
					ПлохиеДанные, ОбъектовОбработано, Параметры);
				ВызватьИсключение СтрСоединить(СписокОписаний, Символы.ПС);
				
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ПлохиеДанные.Количество() > 0 Тогда
		ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(ПлохиеДанные, ОбъектовОбработано, Параметры);
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена =
		ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
